{"config": [{"config": {"name": "conv2d_1", "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "filters": 32, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "filters": 64, "strides": [1, 1], "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "valid", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 10, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}