{"config": [{"config": {"batch_input_shape": [null, 64], "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "dtype": "float32", "trainable": true, "units": 200}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "trainable": true, "units": 4}, "class_name": "Dense"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}